/*
 * =====================================================================================
 *
 *       Filename:  utilstring.h
 *
 *    Description:  存放字符串的操作功能 
 *
 *        Version:  1.0
 *        Created:  2018年11月23日 13时30分38秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  kevin (WangWei), kevin.wang2004@hotmail.com
 *        Company:  LiLin-Tech
 *   Organization:  GNU
 *
 * =====================================================================================
 */

/*
 * =====================================================================================
 *        Class:  Utilstring
 *  Description:  
 * =====================================================================================
 */
class Utilstring
{
	public:
		/* ====================  LIFECYCLE     ======================================= */
		Utilstring ();                                       /* constructor */
		~Utilstring ();                                      /* destructor  */

		void IP_Segment(const char* ip,char (*segment)[4]);

		/* ====================  ACCESSORS     ======================================= */

		/* ====================  MUTATORS      ======================================= */

		/* ====================  OPERATORS     ======================================= */

	protected:
		/* ====================  DATA MEMBERS  ======================================= */

	private:
		/* ====================  DATA MEMBERS  ======================================= */

}; /* -----  end of class Utilstring  ----- */
